/*Реализовать хранимые процедуры для выставления оценок комментариям и постам.*/



/*Учтите, что когда комментарию ставится оценка, то необходимо пересчитать рейтинг комментария и рейтинг пользователя, написавшего этот комментарий.*/

/*Аналогично с постами. Когда ставится оценка посту, то необходимо пересчитать рейтинг поста и рейтинг пользователя, который написал этот пост.*/

/*Так как одна хранимая процедура будет содержать внутри несколько логически связанных между собой действий, то их необходимо объединить в одну транзакцию.*/